{
  "backend/main.mo": "Main actor with blob storage mixin and a stub function for Word to PDF conversion that currently does nothing.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, hooks, and utilities including routing, tool workflows, SEO, ads, and blog functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes including colors, borders, and sidebar styling.",
  "frontend/index.html": "HTML entry point with meta tags, SEO description for Indian PDF/image tools, and root div for React mounting.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes including tools (PDF, image, conversion), blog pages, and homepage with SiteLayout as root.",
  "frontend/src/components/ads/AdSlot.tsx": "Reusable ad placeholder component with four variants (header-banner, sidebar, in-content, pre-download) showing dashed borders and labels.",
  "frontend/src/components/blog/blogPosts.ts": "Blog post registry exporting an array of two blog posts with metadata including slug, title, excerpt, route, and date.",
  "frontend/src/components/faq/ToolFaq.tsx": "Reusable FAQ accordion component that accepts an array of question-answer pairs for tool-specific pages.",
  "frontend/src/components/home/BlogPreview.tsx": "Homepage section displaying the two latest blog posts in cards with 'View All' button linking to blog index.",
  "frontend/src/components/home/Hero.tsx": "Homepage hero section with headline, description, CTA button to merge-pdf tool, and trust indicators for security and privacy.",
  "frontend/src/components/home/HomeFaq.tsx": "Homepage FAQ accordion with five common questions about pricing, accounts, security, file limits, and mobile support.",
  "frontend/src/components/home/toolsCatalog.ts": "Single source of truth exporting TOOLS_CATALOG array with 17 tools including metadata (id, label, description, route, icon, category) for PDF, image, and conversion operations.",
  "frontend/src/components/home/ToolsGrid.tsx": "Responsive grid displaying all tools from TOOLS_CATALOG with icons, descriptions, and start buttons in card layout.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with navigation links to PDF tools, conversion tools, and legal pages, plus a URL copy button and social sharing functionality.",
  "frontend/src/components/layout/Navbar.tsx": "Navigation bar component with logo, desktop/mobile menu toggle, and links to Home, Tools, Blog, and a Get Started button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout wrapper that combines Navbar, Footer, ad slots, and a sidebar with the main content outlet.",
  "frontend/src/components/seo/RelatedToolsLinks.tsx": "Displays a card with links to related tools based on provided tool IDs, filtered from the tools catalog.",
  "frontend/src/components/seo/Seo.tsx": "SEO component that applies meta tags for title and description using the useSeoMeta hook.",
  "frontend/src/components/tools/image/ImageResizeOptions.tsx": "Configuration UI for image resizing with three modes (pixels, percentage, target-size), aspect ratio maintenance, quality settings, and input validation.",
  "frontend/src/components/tools/pdf/ImageToPdfOptions.tsx": "Configuration component for converting images to PDF with options for page size (A4/Letter), fit mode (fit/fill/original), and margin settings.",
  "frontend/src/components/tools/pdf/RemovePagesOptions.tsx": "Input form for specifying which PDF pages to remove using comma-separated numbers and hyphenated ranges (e.g., '1, 3, 5-7').",
  "frontend/src/components/tools/pdf/ResizePdfOptions.tsx": "Simple dropdown selector for choosing target PDF page size from standard formats (A4, Letter, Legal, A3, A5).",
  "frontend/src/components/tools/pdf/WatermarkOptions.tsx": "Configuration form for PDF watermarks with controls for text, opacity, font size, rotation, position, and font style.",
  "frontend/src/components/tools/pdf/WatermarkPreview.tsx": "Canvas-based preview component that renders a watermark on a simulated PDF page using the provided configuration settings.",
  "frontend/src/components/tools/processors/conversion/excelToPdfProcessor.ts": "Converts Excel files to PDF by loading xlsx library from CDN, parsing workbook sheets, and rendering each sheet as a formatted table on PDF pages using pdf-lib with calculated column widths and pagination.",
  "frontend/src/components/tools/processors/conversion/index.ts": "Barrel export file that re-exports all conversion processor functions including PDF, Word, Excel, PowerPoint, JPG, and JPEG converters.",
  "frontend/src/components/tools/processors/conversion/jpegToJpgProcessor.ts": "Converts JPEG files to JPG format (essentially a file extension change) by loading the image to canvas, re-encoding as JPEG with specified quality, and creating a new File object with .jpg extension.",
  "frontend/src/components/tools/processors/conversion/jpgToJpegProcessor.ts": "Converts JPG files to JPEG format (essentially a file extension change) by loading the image to canvas, re-encoding as JPEG with specified quality, and creating a new File object with .jpeg extension.",
  "frontend/src/components/tools/processors/conversion/pdfToExcelProcessor.ts": "Converts PDF to Excel by loading pdf-lib and xlsx libraries, but currently creates a basic placeholder workbook with notes about conversion limitations since pdf-lib lacks text extraction capabilities.",
  "frontend/src/components/tools/processors/conversion/pdfToJpgProcessor.ts": "Converts PDF pages to JPG images by loading PDF.js from CDN to render each page to canvas at 2x scale, converting to JPEG blobs, and packaging multiple pages into a ZIP file using JSZip.",
  "frontend/src/components/tools/processors/conversion/pdfToPowerpointProcessor.ts": "Converts PDF to PowerPoint by loading PptxGenJS and PDF.js libraries, rendering each PDF page as a PNG image, and inserting those images as slides in a new PPTX presentation.",
  "frontend/src/components/tools/processors/conversion/pdfToWordProcessor.ts": "Converts PDF files to Word documents by loading pdf-lib and docx libraries from CDN, extracting text from PDF pages (with limitations), and generating a DOCX file with placeholder content for each page.",
  "frontend/src/components/tools/processors/conversion/powerpointToPdfProcessor.ts": "Converts PowerPoint files to PDF by loading PptxGenJS library from CDN, but creates a simplified PDF with informational text explaining browser limitations rather than full rendering of slides.",
  "frontend/src/components/tools/processors/conversion/wordToPdfLibraries.ts": "Empty file with no content.",
  "frontend/src/components/tools/processors/conversion/wordToPdfProcessor.ts": "Converts Word documents (.doc and .docx) to PDF using a backend API, with file validation (10MB limit), extension checking, and progress reporting.",
  "frontend/src/components/tools/processors/imageResizeProcessor.ts": "Resizes images using three modes (pixels, percentage, target-size) with aspect ratio maintenance, quality settings, and canvas-based rendering with comprehensive validation.",
  "frontend/src/components/tools/processors/pdf/addWatermarkProcessor.ts": "Adds customizable text watermarks to PDF pages using pdf-lib, supporting multiple positions, fonts, opacity, rotation, and applying the watermark to all pages.",
  "frontend/src/components/tools/processors/pdf/compressPdfProcessor.ts": "Compresses PDF files using pdf-lib by loading and re-saving with object streams optimization, though notes that compression capabilities are limited.",
  "frontend/src/components/tools/processors/pdf/imageToPdfProcessor.ts": "Converts multiple image files (JPG/PNG) to a single PDF document using pdf-lib, supporting different page sizes (A4/Letter), fit modes, margins, and centering images on pages.",
  "frontend/src/components/tools/processors/pdf/index.ts": "Barrel export file that re-exports all PDF processor functions and types from individual processor modules (merge, split, compress, resize, remove pages, add watermark, image to PDF).",
  "frontend/src/components/tools/processors/pdf/mergePdfProcessor.ts": "Implements PDF merging functionality using pdf-lib to combine multiple PDF files into a single document with progress tracking and file validation.",
  "frontend/src/components/tools/processors/pdf/pageSizes.ts": "Defines standard page size constants (A4, Letter, Legal, A3, A5) in points and provides a helper function to retrieve page dimensions.",
  "frontend/src/components/tools/processors/pdf/pdfBackendClient.ts": "Deprecated legacy module for backend PDF processing; all functions now throw errors directing users to client-side processing instead.",
  "frontend/src/components/tools/processors/pdf/pdfClient.ts": "Shared PDF utilities that dynamically load pdf-lib from CDN, provide file validation, progress tracking, and helper functions for reading PDFs and getting page counts.",
  "frontend/src/components/tools/processors/pdf/removePagesProcessor.ts": "Implements PDF page removal functionality with support for parsing page ranges (e.g., '1-3,5') and creates a new PDF excluding specified pages using pdf-lib.",
  "frontend/src/components/tools/processors/pdf/resizePdfProcessor.ts": "Resizes PDF pages to standard sizes (A4, Letter, etc.) by creating a new document with target dimensions and embedding scaled/centered original pages.",
  "frontend/src/components/tools/processors/pdf/splitPdfProcessor.ts": "Splits a multi-page PDF into individual single-page PDFs and packages them into a ZIP file using pdf-lib and JSZip loaded from CDN.",
  "frontend/src/components/tools/SelectedFilesList.tsx": "Displays a list of selected files with file name, type, size, and optional remove button for each file.",
  "frontend/src/components/tools/toolError.ts": "Provides structured error handling for tool processing with normalization functions and user-friendly error messages tailored to specific tool types and error conditions.",
  "frontend/src/components/tools/ToolExperience.tsx": "Main tool workflow component managing upload, processing, and download states with progress tracking, error handling, step indicators, and ad slots.",
  "frontend/src/components/tools/ToolNextStepCallout.tsx": "Alert component with animated arrow that highlights the next step in the tool workflow.",
  "frontend/src/components/tools/ToolPageShell.tsx": "Page wrapper component that provides consistent layout with title, description, and content area for tool pages.",
  "frontend/src/components/tools/ToolPrimaryActionButton.tsx": "Styled primary action button with loading state, optional icon, and green theme for main tool actions.",
  "frontend/src/components/tools/ToolResultDownload.tsx": "Success screen component displaying a checkmark and download button for processed files.",
  "frontend/src/components/tools/ToolSecondaryActionButton.tsx": "Styled secondary action button with optional icon and configurable variant for less prominent actions.",
  "frontend/src/components/tools/ToolStepIndicator.tsx": "Visual progress indicator showing three steps (Upload, Adjust Settings, Download) with current step highlighting.",
  "frontend/src/components/tools/UploadDropzone.tsx": "A drag-and-drop file upload component with validation for file types, sizes, and counts, displaying selected files or an upload interface with error handling.",
  "frontend/src/components/trust/TrustNotes.tsx": "React component displaying three trust badges (Secure & Private, No Login Required, Fast Processing) with icons and descriptions in a responsive grid layout.",
  "frontend/src/config/toolLimits.ts": "Defines file size limits for different tool types (default 20MB, images 5MB, conversions 10MB) and provides user-facing error message templates for file validation failures.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useScrollToTop.ts": "React hook that scrolls the window to the top on component mount, using instant scroll on mobile devices and smooth scroll on desktop.",
  "frontend/src/hooks/useSeoMeta.ts": "React hook that dynamically updates the document title and meta description tag for SEO purposes.",
  "frontend/src/hooks/useToolJob.ts": "React hook that manages tool processing job state (idle, uploading, processing, done, error) with progress tracking, result handling, and error normalization.",
  "frontend/src/index.css": "Tailwind CSS configuration with green-themed OKLCH color system for light/dark modes, custom prose styles for blog content, and utility classes for tool sections.",
  "frontend/src/lib/base64.ts": "Utility functions for converting between File, base64 strings, Uint8Array, and Blob formats for file handling.",
  "frontend/src/lib/download.ts": "Utility function to trigger browser file downloads with mobile-friendly handling, including DOM manipulation and delayed cleanup for compatibility.",
  "frontend/src/lib/fileFormat.ts": "Utility functions to format file sizes in human-readable format and generate user-friendly file type labels from MIME types or extensions.",
  "frontend/src/lib/wordToPdfApi.ts": "API function to convert Word documents to PDF via backend actor, handling binary upload with progress tracking and providing user-friendly error messages for various failure scenarios.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/blog/BlogIndexPage.tsx": "Blog index page that displays a list of all blog posts with titles, excerpts, dates, and links to individual articles.",
  "frontend/src/pages/blog/HowToCompressPdfOnlinePage.tsx": "Blog article page explaining how to compress PDF files online, covering benefits, step-by-step instructions, compression techniques, privacy features, and tips for best results with internal tool links.",
  "frontend/src/pages/blog/ResizeImageUnder50KbPage.tsx": "Blog article page providing a guide for resizing images to meet 50KB file size requirements, including use cases (job applications, government forms), step-by-step instructions, and optimization tips.",
  "frontend/src/pages/HomePage.tsx": "Home page component that renders Hero, ToolsGrid, FAQ, and BlogPreview sections with SEO metadata.",
  "frontend/src/pages/tools/AddWatermarkPage.tsx": "Tool page for adding customizable text watermarks to PDF files with live preview, configuration options (opacity, font size, rotation, position, font style), and client-side processing using addWatermarkProcessor.",
  "frontend/src/pages/tools/CompressPdfPage.tsx": "Tool page for compressing PDF files to reduce file size while maintaining quality, using compressPdfProcessor with client-side processing and FAQ section explaining compression results and security.",
  "frontend/src/pages/tools/ExcelToPdfPage.tsx": "Tool page for converting Excel spreadsheets (.xlsx, .xls) to PDF format using excelToPdfProcessor, supporting multiple sheets with browser-based conversion and file size limit of 10MB.",
  "frontend/src/pages/tools/ImageToPdfPage.tsx": "Tool page for converting multiple images (JPG, PNG) into a single PDF document with configurable page size, fit mode, and margins using imageToPdfProcessor with up to 20 images supported.",
  "frontend/src/pages/tools/JpegToJpgPage.tsx": "Page component for converting JPEG files to JPG format, using jpegToJpgProcessor and displaying FAQ about the identical formats with different extensions.",
  "frontend/src/pages/tools/JpgToJpegPage.tsx": "Page component for converting JPG files to JPEG format, using jpgToJpegProcessor and displaying FAQ explaining they are the same format with different naming conventions.",
  "frontend/src/pages/tools/MergePdfPage.tsx": "Page component for merging multiple PDF files into one document, using mergePdfProcessor with support for up to 10 files and preserving page order.",
  "frontend/src/pages/tools/PdfToExcelPage.tsx": "Page component for converting PDF documents to Excel spreadsheets, extracting tabular data using pdfToExcelProcessor with 10MB file size limit and multi-page support.",
  "frontend/src/pages/tools/PdfToJpgPage.tsx": "Page component for converting PDF pages to JPG images, using pdfToJpgProcessor that outputs single JPG for one-page PDFs or ZIP file for multi-page documents.",
  "frontend/src/pages/tools/PdfToPowerpointPage.tsx": "Page component for converting PDF documents to PowerPoint presentations, using pdfToPowerpointProcessor to render each PDF page as an image on separate slides.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "Page component for converting PDF files to Word (.docx) format with text extraction, file upload, progress tracking, and FAQ section. Handles validation, processing via pdfToWordProcessor, and displays alerts about conversion limitations.",
  "frontend/src/pages/tools/PowerpointToPdfPage.tsx": "Page component for converting PowerPoint (.pptx/.ppt) files to PDF format with file upload, progress tracking, and FAQ section. Uses powerpointToPdfProcessor to handle conversion entirely in the browser.",
  "frontend/src/pages/tools/RemovePagesPage.tsx": "Page component for removing specified pages from PDF files using page ranges or individual page numbers. Includes page count detection, range parsing, and FAQ explaining the page specification syntax.",
  "frontend/src/pages/tools/ResizeImagePage.tsx": "Page component for resizing images (JPEG, PNG, WEBP) with file validation (5MB limit), preview generation for both input and output, and dimension tracking. Uses resizeImage processor with configurable resize options.",
  "frontend/src/pages/tools/ResizePdfPage.tsx": "Page component for resizing PDF pages to standard sizes (A4, Letter, Legal, A3, A5) while maintaining aspect ratio. Uses resizePdfProcessor with selectable target page size options.",
  "frontend/src/pages/tools/SplitPdfPage.tsx": "Page component for splitting PDF files into individual pages, each as a separate PDF packaged in a ZIP archive. Uses splitPdfProcessor with progress tracking and FAQ about page extraction.",
  "frontend/src/pages/tools/word-to-pdf/INTEGRATION.md": "Integration documentation describing the rebuilt Word-to-PDF module structure, modified/added files, API integration details, and backend method signature.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfErrorCard.tsx": "Error display component showing conversion failure message with conditional retry button (based on error type) and start over option.",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfFaq.ts": "FAQ content array defining six common questions and answers about Word to PDF conversion (formats, size limits, timing, security, formatting, password protection).",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfProgressCard.tsx": "Progress indicator component displaying animated loader, status messages, file name, and progress bar for uploading and converting states.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfResultCard.tsx": "Success result component showing checkmark icon, success message, file name, download button, and option to process another file.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTheme.ts": "Module-scoped styling constants defining green/white theme colors and button styles for the Word-to-PDF tool.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTool.tsx": "Main orchestrator component managing conversion state machine (idle, uploading, converting, success, error), file handling, API calls, progress tracking, and rendering appropriate UI cards.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfUploadCard.tsx": "Upload interface component with drag-and-drop zone, file input, selected file preview with metadata, and convert button.",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfValidation.ts": "File validation utility function checking Word file existence, size (10MB limit), and extension (.doc/.docx), returning validation result with error messages.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "Main page component for Word to PDF converter that renders SEO metadata, header, description, the WordToPdfTool component, ads, FAQ section, and related tools links.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, border radius, animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking feature requests (AR-1 through AR-4) to change watermark tool sliders (opacity, font size, rotation) to green color, all currently in pending status."
}