{
  "backend/main.mo": "Actor includes blob storage mixin and exposes a stubbed convertWordToPdf function.",
  "feature_evidence.json": "Feature evidence file documenting a UI styling update and listing related components and files.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of many frontend components for reference.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light and dark themes with utility applications.",
  "frontend/index.html": "Root HTML document with metadata and script entry point for the frontend app.",
  "frontend/src/App.tsx": "Main React router setup defining all app routes and rendering RouterProvider.",
  "frontend/src/components/ads/AdSlot.tsx": "Reusable ad slot component rendering styled placeholder blocks by variant.",
  "frontend/src/components/blog/blogPosts.ts": "Static blog post registry exporting metadata for available posts.",
  "frontend/src/components/faq/ToolFaq.tsx": "Reusable FAQ component rendering a list of Q&A entries inside an accordion.",
  "frontend/src/components/home/BlogPreview.tsx": "Lists two latest blog posts with preview cards and link to full blog index.",
  "frontend/src/components/home/Hero.tsx": "Hero section with headline, description, and main CTA button linking to merge PDF tool.",
  "frontend/src/components/home/HomeFaq.tsx": "Home page FAQ section with predefined questions rendered in an accordion.",
  "frontend/src/components/home/toolsCatalog.ts": "Defines metadata for all tools including labels, descriptions, routes, and icons.",
  "frontend/src/components/home/ToolsGrid.tsx": "Displays all tools from TOOLS_CATALOG as cards with icons and navigation buttons.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with tool links, trust notes, and a URL copy button. Handles copying the site URL and displays sections for PDF tools, image tools, and resources.",
  "frontend/src/components/layout/Navbar.tsx": "Provides a responsive navigation bar with logo, links, and a Get Started button. Includes a mobile menu toggle and navigation behavior.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site structure with navbar, footer, sidebar ads, and an outlet for page content. Ensures consistent layout and placements of ad slots.",
  "frontend/src/components/seo/RelatedToolsLinks.tsx": "Displays a card listing related tools based on the current tool and provided IDs. Pulls metadata from the tools catalog and links to each tool’s route.",
  "frontend/src/components/seo/Seo.tsx": "Applies SEO metadata for a page using a custom hook. Renders nothing visually.",
  "frontend/src/components/tools/image/ImageResizeOptions.tsx": "UI for configuring image resize options including pixel, percentage, and target-size modes with validation before processing.",
  "frontend/src/components/tools/pdf/ImageToPdfOptions.tsx": "Form for choosing PDF page size, image fit mode, and margins when converting images to a PDF.",
  "frontend/src/components/tools/pdf/RemovePagesOptions.tsx": "Input UI for specifying PDF pages to remove using comma and range syntax with examples.",
  "frontend/src/components/tools/pdf/ResizePdfOptions.tsx": "Selector for choosing a target PDF page size from common formats.",
  "frontend/src/components/tools/pdf/WatermarkOptions.tsx": "Controls for editing watermark text, position, style, opacity, font size, and rotation.",
  "frontend/src/components/tools/pdf/WatermarkPreview.tsx": "Canvas-based preview rendering the configured watermark on an A4-like mock page.",
  "frontend/src/components/tools/processors/conversion/index.ts": "Barrel file exporting PDF/Word conversion processors and related types.",
  "frontend/src/components/tools/processors/conversion/pdfToWordProcessor.ts": "Client‑side PDF to DOCX converter using pdf-lib and docx with placeholder text extraction and progress updates.",
  "frontend/src/components/tools/processors/conversion/wordToPdfLibraries.ts": "Empty file placeholder for Word-to-PDF related libraries.",
  "frontend/src/components/tools/processors/conversion/wordToPdfProcessor.ts": "Validates Word files and converts them to PDF via backend API with progress reporting.",
  "frontend/src/components/tools/processors/imageResizeProcessor.ts": "Resizes images using various modes, validating inputs and generating resized blobs with progress handling.",
  "frontend/src/components/tools/processors/pdf/addWatermarkProcessor.ts": "Adds text watermarks to each PDF page using pdf-lib with configurable style and progress tracking.",
  "frontend/src/components/tools/processors/pdf/compressPdfProcessor.ts": "Performs basic client‑side PDF compression via pdf-lib save options and returns a compressed Blob.",
  "frontend/src/components/tools/processors/pdf/imageToPdfProcessor.ts": "Converts multiple images into a PDF with selectable page size, fit mode, margins, and progress updates.",
  "frontend/src/components/tools/processors/pdf/index.ts": "Exports all PDF processing utilities including merge, split, compress, resize, watermark, and image‑to‑PDF.",
  "frontend/src/components/tools/processors/pdf/mergePdfProcessor.ts": "Merges multiple PDF files client‑side by copying pages into a single pdf-lib document.",
  "frontend/src/components/tools/processors/pdf/pageSizes.ts": "Defines standard page size dimensions and a helper for retrieving them.",
  "frontend/src/components/tools/processors/pdf/pdfBackendClient.ts": "Deprecated backend PDF client with stubbed functions, retained only for compatibility.",
  "frontend/src/components/tools/processors/pdf/pdfClient.ts": "Utility functions for loading pdf-lib from CDN, validating files, reading PDFs, and reporting progress.",
  "frontend/src/components/tools/processors/pdf/removePagesProcessor.ts": "Removes specified pages from a PDF after validation and progress updates, producing a new PDF blob.",
  "frontend/src/components/tools/processors/pdf/resizePdfProcessor.ts": "Resizes each page of a PDF to a target page size, scaling content proportionally and generating a new PDF.",
  "frontend/src/components/tools/processors/pdf/splitPdfProcessor.ts": "Splits a multi-page PDF into individual PDFs and packages them into a ZIP file using PDFLib and JSZip.",
  "frontend/src/components/tools/SelectedFilesList.tsx": "Shows a list of selected files with type and size info, plus optional remove buttons. Helps users manage uploaded files.",
  "frontend/src/components/tools/toolError.ts": "Provides structured error normalization and user-friendly error messages for various tool operations.",
  "frontend/src/components/tools/ToolExperience.tsx": "Handles the full workflow for a tool: upload, options, progress, errors, and result download. Manages UI state transitions, auto-scrolling, and step indicators.",
  "frontend/src/components/tools/ToolNextStepCallout.tsx": "Displays a brief animated callout prompting users to proceed to the next step. Highlights instructions with icons and visual emphasis.",
  "frontend/src/components/tools/ToolPageShell.tsx": "Provides a page container with title, description, and space for tool-specific content. Standardizes layout for tool pages.",
  "frontend/src/components/tools/ToolPrimaryActionButton.tsx": "A styled primary action button supporting loading states and optional icons. Used for key actions like processing or downloading.",
  "frontend/src/components/tools/ToolResultDownload.tsx": "Shows a success panel with a download button for processed files. Uses a primary action button and triggers blob downloads.",
  "frontend/src/components/tools/ToolSecondaryActionButton.tsx": "A flexible secondary button with optional icon and variants. Used for auxiliary actions within tool flows.",
  "frontend/src/components/tools/ToolStepIndicator.tsx": "Visually represents the current tool workflow step across upload, settings, and download. Highlights progress using icons and color changes.",
  "frontend/src/components/tools/UploadDropzone.tsx": "Drag-and-drop file selector with validation for file count, size, and extension, returning selected files to a callback.",
  "frontend/src/components/trust/TrustNotes.tsx": "React component displaying trust-related notes about security, privacy, and client-side processing.",
  "frontend/src/config/toolLimits.ts": "Defines file size limits and user-facing error messages for different tool categories.",
  "frontend/src/hooks/useActor.ts": "React hook that manages authenticated or anonymous backend actors and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and status handling.",
  "frontend/src/hooks/useSeoMeta.ts": "Custom hook that updates the document title and meta description based on provided values.",
  "frontend/src/hooks/useToolJob.ts": "Manages job state for file processing tools, including status, progress, results, and error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and a green-themed design system with custom prose and utility classes.",
  "frontend/src/lib/base64.ts": "Helpers for converting files to base64 and converting base64 strings into Uint8Array or Blob objects.",
  "frontend/src/lib/download.ts": "Utility that triggers browser-safe blob downloads with mobile-friendly cleanup handling.",
  "frontend/src/lib/fileFormat.ts": "Functions for formatting file sizes and determining human-readable file type labels.",
  "frontend/src/lib/wordToPdfApi.ts": "Client helper for invoking backend Word‑to‑PDF conversion with progress tracking and detailed error mapping.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, and wraps the app with Internet Identity provider.",
  "frontend/src/pages/blog/BlogIndexPage.tsx": "Renders the blog index with SEO metadata and a list of blog post previews linking to their routes.",
  "frontend/src/pages/blog/HowToCompressPdfOnlinePage.tsx": "Blog article page explaining how to compress PDFs online with a structured guide and related links.",
  "frontend/src/pages/blog/ResizeImageUnder50KbPage.tsx": "Blog page explaining how to resize images under 50KB, with instructions, tips, and links to the resize tool.",
  "frontend/src/pages/HomePage.tsx": "Home page rendering SEO metadata and the main homepage sections such as hero, tools, FAQ, and blog preview.",
  "frontend/src/pages/tools/AddWatermarkPage.tsx": "Tool page for adding customizable text watermarks to PDFs, handling file input, config options, processing, and FAQs.",
  "frontend/src/pages/tools/CompressPdfPage.tsx": "Tool page for compressing a single PDF in-browser, using a processor with progress tracking and related FAQs.",
  "frontend/src/pages/tools/ImageToPdfPage.tsx": "Tool page for converting multiple images to a PDF with page size and fit options, file management, and FAQs.",
  "frontend/src/pages/tools/MergePdfPage.tsx": "Tool page that merges multiple PDFs into one using client-side processing, with FAQs and related tool links.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "Tool page converting a PDF to DOCX with browser-side text extraction, error handling, and conversion limitations noted.",
  "frontend/src/pages/tools/RemovePagesPage.tsx": "React page for removing pages from a PDF, handling file selection, page‑range parsing, processing, and error states.",
  "frontend/src/pages/tools/ResizeImagePage.tsx": "Image‑resize tool page that validates image files, shows previews, processes resizing, and displays output dimensions.",
  "frontend/src/pages/tools/ResizePdfPage.tsx": "PDF‑resize tool page enabling users to select a PDF, choose a target size, run the resize processor, and handle job states.",
  "frontend/src/pages/tools/SplitPdfPage.tsx": "PDF‑splitting page that turns each PDF page into separate files packaged in a ZIP, using the split processor and job system.",
  "frontend/src/pages/tools/word-to-pdf/INTEGRATION.md": "Documentation describing the Word‑to‑PDF module, its components, integration details, and API updates.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfErrorCard.tsx": "UI card displaying conversion errors with retry action and themed styling.",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfFaq.ts": "Exports static FAQ entries describing usage, limits, and behavior of the Word‑to‑PDF tool.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfProgressCard.tsx": "Progress UI card showing upload/convert states, progress bar, and status messaging for Word‑to‑PDF tasks.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfResultCard.tsx": "Displays the success UI for a completed Word-to-PDF conversion, including download and reset actions.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTheme.ts": "Defines shared green/white theme classes and colors for the Word-to-PDF tool.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTool.tsx": "Main container managing file selection, validation, conversion flow, progress, success, and error states.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfUploadCard.tsx": "Provides drag‑and‑drop upload UI and file preview with options to convert or remove the selected file.",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfValidation.ts": "Validates selected Word files for type and size, enforcing .doc/.docx and a 10MB limit.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "Main Word‑to‑PDF converter page that wraps the WordToPdfTool with SEO, layout, ads, FAQ, and related‑tool links.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata capturing state, features, issues, and new feature requests."
}