{
  "backend/main.mo": "Main Motoko actor that includes blob storage mixin and defines a convertWordToPdf function stub that currently does nothing.",
  "feature_evidence.json": "Feature evidence report documenting four features related to Word-to-PDF conversion: rebuilding conversion logic, ensuring proper downloads, adding error handling, and implementing retry functionality.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, utilities, and configuration files for the QuickPDF India application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using OKLCH color space.",
  "frontend/index.html": "HTML entry point with meta tags for SEO, viewport configuration, and root div for React application mounting.",
  "frontend/src/App.tsx": "Main React application component that configures TanStack Router with routes for all tool pages, blog pages, and the home page.",
  "frontend/src/components/ads/AdSlot.tsx": "Reusable ad placeholder component supporting four variants (header-banner, sidebar, in-content, pre-download) with dashed border styling.",
  "frontend/src/components/blog/blogPosts.ts": "Blog post registry exporting an array of blog post metadata including slug, title, excerpt, route, and date for two articles.",
  "frontend/src/components/faq/ToolFaq.tsx": "Reusable FAQ component that renders an accordion of questions and answers for tool-specific pages.",
  "frontend/src/components/home/BlogPreview.tsx": "Home page section displaying the two latest blog posts in cards with links to read more and view all posts.",
  "frontend/src/components/home/Hero.tsx": "Hero section with headline, description, CTA button to start processing, and trust indicators for security and privacy.",
  "frontend/src/components/home/HomeFaq.tsx": "Home page FAQ section with accordion displaying five common questions about the service including pricing, accounts, security, limits, and mobile support.",
  "frontend/src/components/home/toolsCatalog.ts": "Defines the TOOLS_CATALOG array containing metadata for all available tools (merge, split, compress PDF, image conversion, etc.) with their routes, icons, and categories.",
  "frontend/src/components/home/ToolsGrid.tsx": "Responsive grid component displaying all available tools from TOOLS_CATALOG with icons, descriptions, and start buttons.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with tool links organized by category, trust indicators, URL copy functionality, and copyright information.",
  "frontend/src/components/layout/Navbar.tsx": "Provides the fixed top navigation bar with logo, navigation links, and a responsive mobile menu with hamburger toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout wrapper that combines Navbar, Footer, ad slots, and a sidebar, rendering child routes via Outlet.",
  "frontend/src/components/seo/RelatedToolsLinks.tsx": "Displays a card with links to related tools based on provided tool IDs, filtering out the current tool.",
  "frontend/src/components/seo/Seo.tsx": "SEO component that applies meta tags for title and description using the useSeoMeta hook.",
  "frontend/src/components/tools/image/ImageResizeOptions.tsx": "Provides UI controls for image resizing with three modes (pixels, percentage, target-size), aspect ratio maintenance, quality selection, and input validation.",
  "frontend/src/components/tools/pdf/ImageToPdfOptions.tsx": "Configuration UI for converting images to PDF, allowing selection of page size, image fit mode, and margin settings.",
  "frontend/src/components/tools/pdf/RemovePagesOptions.tsx": "Input form for specifying which PDF pages to remove using comma-separated numbers and hyphenated ranges.",
  "frontend/src/components/tools/pdf/ResizePdfOptions.tsx": "Dropdown selector for choosing target PDF page size from standard formats (A4, Letter, Legal, A3, A5).",
  "frontend/src/components/tools/pdf/WatermarkOptions.tsx": "Configuration UI for PDF watermarks with controls for text, opacity, font size, rotation, position, and font style.",
  "frontend/src/components/tools/pdf/WatermarkPreview.tsx": "Canvas-based preview component that renders a watermark on a simulated PDF page using the provided configuration.",
  "frontend/src/components/tools/processors/conversion/index.ts": "Barrel export file that re-exports PDF-to-Word and Word-to-PDF processors with their types.",
  "frontend/src/components/tools/processors/conversion/pdfToWordProcessor.ts": "Converts PDF files to Word documents (DOCX) by loading pdf-lib and docx libraries from CDN, extracting placeholder text per page (actual text extraction not implemented), and generating a DOCX blob with page breaks.",
  "frontend/src/components/tools/processors/conversion/wordToPdfLibraries.ts": "Empty file with no content.",
  "frontend/src/components/tools/processors/conversion/wordToPdfProcessor.ts": "Converts Word documents (.doc/.docx) to PDF using a backend API, with file validation (type, size up to 10MB), progress reporting, and error handling.",
  "frontend/src/components/tools/processors/imageResizeProcessor.ts": "Resizes images using canvas API with three modes (pixels, percentage, target-size), supports aspect ratio maintenance, quality settings, and includes comprehensive validation and progress reporting.",
  "frontend/src/components/tools/processors/pdf/addWatermarkProcessor.ts": "Adds text watermarks to PDF pages using pdf-lib with configurable opacity, font size, rotation, position (center/corners), and font style (Helvetica/Times/Courier).",
  "frontend/src/components/tools/processors/pdf/compressPdfProcessor.ts": "Compresses PDF files using pdf-lib by loading and re-saving with object streams optimization, though compression capabilities are limited by the library.",
  "frontend/src/components/tools/processors/pdf/imageToPdfProcessor.ts": "Converts multiple images (JPG/PNG) to a single PDF using pdf-lib with configurable page size (A4/Letter), fit modes (fit/fill/original), and margins.",
  "frontend/src/components/tools/processors/pdf/index.ts": "Barrel export file that re-exports all PDF processor functions and types from the pdf directory.",
  "frontend/src/components/tools/processors/pdf/mergePdfProcessor.ts": "Merges multiple PDF files into a single document using pdf-lib by copying all pages from each input file sequentially.",
  "frontend/src/components/tools/processors/pdf/pageSizes.ts": "Defines standard page size constants (A4, Letter, Legal, A3, A5) in points with a helper function to retrieve dimensions.",
  "frontend/src/components/tools/processors/pdf/pdfBackendClient.ts": "Deprecated legacy module for backend PDF processing; all functions now throw errors directing users to client-side processing with pdf-lib instead.",
  "frontend/src/components/tools/processors/pdf/pdfClient.ts": "Provides shared PDF processing utilities that dynamically load pdf-lib from CDN, including functions for loading the library, getting page counts, validating file sizes, reading files as ArrayBuffer, and updating progress callbacks.",
  "frontend/src/components/tools/processors/pdf/removePagesProcessor.ts": "Implements PDF page removal functionality with page range parsing support (e.g., \"1-3,5\"), validates page numbers, and creates a new PDF document excluding specified pages while enforcing a 10MB file size limit.",
  "frontend/src/components/tools/processors/pdf/resizePdfProcessor.ts": "Resizes PDF pages to standard sizes (A4, Letter, Legal, A3, A5) by creating a new PDF document with target dimensions and embedding scaled/centered original pages while maintaining aspect ratio.",
  "frontend/src/components/tools/processors/pdf/splitPdfProcessor.ts": "Splits a multi-page PDF into individual single-page PDFs, packages them into a ZIP file using dynamically loaded JSZip library, and enforces a 20MB file size limit.",
  "frontend/src/components/tools/SelectedFilesList.tsx": "Displays a list of selected files with file type, size, and optional remove buttons for each file.",
  "frontend/src/components/tools/toolError.ts": "Defines structured error handling for tool processing failures with normalization functions and user-friendly error messages tailored to specific tool types and error conditions.",
  "frontend/src/components/tools/ToolExperience.tsx": "Main tool workflow component managing upload, processing states, progress display, error handling, result download, and step indicators with auto-scroll to options.",
  "frontend/src/components/tools/ToolNextStepCallout.tsx": "Shows an animated alert with sparkles and arrow icon to guide users to the next step in the tool workflow.",
  "frontend/src/components/tools/ToolPageShell.tsx": "Layout wrapper for tool pages providing consistent title, description, and content container styling.",
  "frontend/src/components/tools/ToolPrimaryActionButton.tsx": "Styled primary action button with green theme, loading state, and optional icon for main tool actions.",
  "frontend/src/components/tools/ToolResultDownload.tsx": "Success screen component displaying a checkmark, success message, and download button for processed files.",
  "frontend/src/components/tools/ToolSecondaryActionButton.tsx": "Styled secondary action button with outline or ghost variants for less prominent tool actions.",
  "frontend/src/components/tools/ToolStepIndicator.tsx": "Visual progress indicator showing three steps (Upload, Settings, Download) with checkmarks for completed steps.",
  "frontend/src/components/tools/UploadDropzone.tsx": "A drag-and-drop file upload component with validation for file types, sizes, and counts, displaying selected files or a dropzone UI with error handling.",
  "frontend/src/components/trust/TrustNotes.tsx": "Displays a trust banner component with three key features: secure/private file handling, no login requirement, and fast client-side processing, using icons and descriptive text.",
  "frontend/src/config/toolLimits.ts": "Defines file size limits for different tool types (default 20MB, images 5MB, conversions 10MB) and provides standardized error messages for limit violations and file validation failures.",
  "frontend/src/hooks/useActor.ts": "React hook that manages backend actor creation with Internet Identity authentication, caching the actor instance and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useScrollToTop.ts": "Custom React hook that scrolls the window to the top on component mount, using instant scroll on mobile devices and smooth scroll on desktop.",
  "frontend/src/hooks/useSeoMeta.ts": "Custom React hook that dynamically updates the document title and meta description for SEO purposes.",
  "frontend/src/hooks/useToolJob.ts": "Custom React hook managing tool job state (idle, uploading, processing, done, error) with progress tracking, error handling, and result file management.",
  "frontend/src/index.css": "Tailwind CSS configuration with green-themed OKLCH color system for light/dark modes, custom prose styles for blog content, and tool section utilities.",
  "frontend/src/lib/base64.ts": "Utility functions for converting between File, base64 strings, Uint8Array, and Blob formats for binary data handling.",
  "frontend/src/lib/download.ts": "Utility function to trigger file downloads in the browser with mobile-friendly handling, including DOM manipulation and delayed cleanup.",
  "frontend/src/lib/fileFormat.ts": "Utility functions to format file sizes in human-readable format and get user-friendly file type labels from MIME types or extensions.",
  "frontend/src/lib/wordToPdfApi.ts": "API wrapper for converting Word documents to PDF using backend actor, with progress tracking and comprehensive error handling for various backend failure scenarios.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/blog/BlogIndexPage.tsx": "Blog index page displaying a list of all blog posts with titles, excerpts, dates, and links to individual articles with SEO metadata.",
  "frontend/src/pages/blog/HowToCompressPdfOnlinePage.tsx": "Blog article page explaining how to compress PDF files online, covering benefits, step-by-step instructions, compression techniques, privacy features, and tips for best results with links to related tools.",
  "frontend/src/pages/blog/ResizeImageUnder50KbPage.tsx": "Blog article page providing a guide for resizing images to meet 50KB file size requirements, including use cases (job applications, government forms), step-by-step instructions, and optimization tips.",
  "frontend/src/pages/HomePage.tsx": "Home page component rendering Hero, ToolsGrid, HomeFaq, and BlogPreview sections with SEO metadata for the main landing page.",
  "frontend/src/pages/tools/AddWatermarkPage.tsx": "Tool page for adding customizable text watermarks to PDF files with options for opacity, font size, rotation, position, and font style, featuring live preview and client-side processing.",
  "frontend/src/pages/tools/CompressPdfPage.tsx": "Tool page for compressing PDF files to reduce file size while maintaining quality, using client-side processing with FAQ section and related tool links.",
  "frontend/src/pages/tools/ImageToPdfPage.tsx": "Tool page for converting multiple images (JPG, PNG) into a single PDF document with configurable page size, fit mode, and margin options, supporting up to 20 images.",
  "frontend/src/pages/tools/MergePdfPage.tsx": "Tool page for combining multiple PDF files into a single document while preserving page order, supporting up to 10 files with client-side processing.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "Page component for converting PDF files to Word (.docx) format with text extraction, file upload, progress tracking, and FAQ section.",
  "frontend/src/pages/tools/RemovePagesPage.tsx": "Page component for removing specified pages from PDFs using page ranges or individual page numbers, with validation and preview of page count.",
  "frontend/src/pages/tools/ResizeImagePage.tsx": "Page component for resizing images (JPEG, PNG, WEBP) with preview, dimension display, file validation (5MB limit), and before/after comparison.",
  "frontend/src/pages/tools/ResizePdfPage.tsx": "Page component for resizing PDF pages to standard sizes (A4, Letter, Legal, A3, A5) with proportional content scaling and browser-based processing.",
  "frontend/src/pages/tools/SplitPdfPage.tsx": "Page component for splitting PDF into individual page files packaged as a ZIP archive, with client-side processing and FAQ section.",
  "frontend/src/pages/tools/word-to-pdf/INTEGRATION.md": "Integration documentation describing the rebuilt Word-to-PDF module structure, modified files, new components, API integration, and backend method signatures.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfErrorCard.tsx": "Error card component that displays conversion failure messages with conditional retry and start-over buttons based on error type (retryable vs non-retryable errors like invalid files).",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfFaq.ts": "FAQ data array containing six common questions and answers about Word-to-PDF conversion including supported formats, file size limits, security, and formatting preservation.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfProgressCard.tsx": "Progress card component showing animated loader and progress bar for uploading and converting states with file name and percentage display.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfResultCard.tsx": "Success card component displaying conversion completion with download button and option to process another file, using downloadBlob utility for file download.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTheme.ts": "Theme configuration object defining green/white color scheme (#22c55e primary) and styling constants for the Word-to-PDF tool UI.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTool.tsx": "Main orchestrator component managing the complete Word-to-PDF conversion flow with state machine (idle/uploading/converting/success/error) and file handling logic.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfUploadCard.tsx": "Upload interface component with drag-and-drop support, file input, and file preview showing selected document details with convert/remove actions.",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfValidation.ts": "File validation utility function checking Word document type (.doc/.docx), size limits (10MB max), and returning structured validation results with error messages.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "Page component for converting Word documents (.doc, .docx) to PDF format, delegating to WordToPdfTool component with SEO, ads, and related tools.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state file for a document conversion tool that converts Word (.doc/.docx) to PDF with formatting preservation, error handling, retry functionality, and file download capabilities. Tracks four existing features related to conversion logic, download mechanism, error handling, and retry button implementation."
}