{
  "backend/main.mo": "Defines watermark config storage and exposes endpoints for saving configs and converting DOCX to PDF using an HTTP outcall.",
  "feature_evidence.json": "Lists feature reports, associated files, components, and test IDs for Word-to-PDF and related tooling updates.",
  "frontend-file-summaries.txt": "Provides short descriptions of many frontend files for documentation or build reference.",
  "frontend/index.css": "Tailwind base setup with light/dark theme CSS variables and global styling rules.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all pages and renders the router provider.",
  "frontend/src/components/ads/AdSlot.tsx": "Reusable ad placeholder component supporting multiple size variants.",
  "frontend/src/components/blog/blogPosts.ts": "Defines blog post metadata and exports the list of posts.",
  "frontend/src/components/faq/ToolFaq.tsx": "Renders a FAQ section using an accordion with provided items.",
  "frontend/src/components/home/BlogPreview.tsx": "Displays the two latest blog posts with links and a button to view all posts.",
  "frontend/src/components/home/Hero.tsx": "Homepage hero section with headline, description, and CTA button.",
  "frontend/src/components/home/HomeFaq.tsx": "Homepage FAQ section showing common questions using an accordion.",
  "frontend/src/components/home/toolsCatalog.ts": "Defines the Tool interface and exports a catalog of PDF, image, and conversion tools with metadata.",
  "frontend/src/components/home/ToolsGrid.tsx": "Displays a grid of tool cards from TOOLS_CATALOG and navigates to each tool’s route.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with tool links, resources, trust notes, and a URL copy button.",
  "frontend/src/components/layout/Navbar.tsx": "Provides a responsive navigation bar with links and a mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the global page layout including navbar, footer, sidebar ads, and routed content area.",
  "frontend/src/components/seo/RelatedToolsLinks.tsx": "Shows a list of related tools based on tool IDs with links and descriptions.",
  "frontend/src/components/seo/Seo.tsx": "Applies SEO metadata using useSeoMeta and renders nothing visually.",
  "frontend/src/components/tools/image/ImageResizeOptions.tsx": "UI for configuring image resize options including pixel, percentage, or target size modes with aspect ratio control.",
  "frontend/src/components/tools/pdf/ImageToPdfOptions.tsx": "Form for choosing PDF page size, image fit mode, and margins when converting images to PDF.",
  "frontend/src/components/tools/pdf/RemovePagesOptions.tsx": "Inputs for specifying PDF pages to remove with examples and optional total page count display.",
  "frontend/src/components/tools/pdf/ResizePdfOptions.tsx": "UI for selecting a target page size to resize an existing PDF.",
  "frontend/src/components/tools/pdf/WatermarkOptions.tsx": "Config panel for setting watermark text, style, position, opacity, rotation, and font options.",
  "frontend/src/components/tools/pdf/WatermarkPreview.tsx": "Canvas‑based live preview showing how the configured watermark will appear in a PDF.",
  "frontend/src/components/tools/processors/conversion/index.ts": "Re‑exports the pdfToWordProcessor from its module.",
  "frontend/src/components/tools/processors/conversion/pdfToWordProcessor.ts": "Client-side PDF-to-Word converter using pdf-lib and docx, loading libraries dynamically and generating placeholder text per page.",
  "frontend/src/components/tools/processors/conversion/wordToPdfLibraries.ts": "Empty file with no implementation.",
  "frontend/src/components/tools/processors/conversion/wordToPdfProcessor.ts": "Empty file with no implementation.",
  "frontend/src/components/tools/processors/imageResizeProcessor.ts": "Resizes images using canvas with modes for pixel size, percentage, or target file size, including quality adjustment and progress updates.",
  "frontend/src/components/tools/processors/pdf/addWatermarkProcessor.ts": "Adds customizable text watermarks to each PDF page using pdf-lib, supporting fonts, positioning, rotation, and progress tracking.",
  "frontend/src/components/tools/processors/pdf/compressPdfProcessor.ts": "Performs basic client-side PDF compression via pdf-lib by re-saving with optimized settings and reporting size changes.",
  "frontend/src/components/tools/processors/pdf/imageToPdfProcessor.ts": "Converts one or more images to a PDF, embedding JPG/PNG files and fitting them to A4 or Letter pages with configurable modes and margins.",
  "frontend/src/components/tools/processors/pdf/index.ts": "Re-exports all PDF processor modules and related types for unified access.",
  "frontend/src/components/tools/processors/pdf/mergePdfProcessor.ts": "Merges multiple PDFs client-side by copying pages into a new document using pdf-lib with progress updates.",
  "frontend/src/components/tools/processors/pdf/pageSizes.ts": "Defines standard page sizes and a helper to retrieve their dimensions.",
  "frontend/src/components/tools/processors/pdf/pdfBackendClient.ts": "Deprecated backend PDF client containing nonfunctional placeholders now replaced by client-side pdf-lib processing.",
  "frontend/src/components/tools/processors/pdf/pdfClient.ts": "Client-side PDF utility module that loads pdf-lib from CDN, validates files, reads PDFs, and provides helpers like page counting and progress updates.",
  "frontend/src/components/tools/processors/pdf/removePagesProcessor.ts": "Implements PDF page removal by loading the file, validating ranges, copying remaining pages, and outputting a new PDF.",
  "frontend/src/components/tools/processors/pdf/resizePdfProcessor.ts": "Resizes each PDF page to a target page size, scaling and centering content before generating a new PDF.",
  "frontend/src/components/tools/processors/pdf/splitPdfProcessor.ts": "Splits a PDF into individual pages and packages them into a ZIP file using pdf-lib and JSZip.",
  "frontend/src/components/tools/SelectedFilesList.tsx": "Displays selected file items with type and size, optionally allowing removal.",
  "frontend/src/components/tools/toolError.ts": "Defines structured tool errors and provides logic to normalize errors and produce user-friendly messages.",
  "frontend/src/components/tools/ToolExperience.tsx": "Manages the full tool workflow including upload, options, progress, errors, and result display.",
  "frontend/src/components/tools/ToolNextStepCallout.tsx": "Shows a temporary highlighted callout prompting the user to proceed to the next step.",
  "frontend/src/components/tools/ToolPageShell.tsx": "Provides a standard page shell with title, description, and content layout for tool pages.",
  "frontend/src/components/tools/ToolPrimaryActionButton.tsx": "A styled primary action button supporting loading states and optional icons.",
  "frontend/src/components/tools/ToolResultDownload.tsx": "Displays a success message and button to download the generated file.",
  "frontend/src/components/tools/ToolSecondaryActionButton.tsx": "A secondary action button with optional icon and variant styling.",
  "frontend/src/components/tools/ToolStepIndicator.tsx": "Renders a 3‑step progress indicator showing upload, settings, and download states with visual highlighting.",
  "frontend/src/components/tools/UploadDropzone.tsx": "Provides a drag‑and‑drop file uploader with type/size validation and selected file management.",
  "frontend/src/components/trust/TrustNotes.tsx": "UI component displaying trust and security notes with icons about privacy, no login, and fast processing.",
  "frontend/src/config/toolLimits.ts": "Defines file size limits and standardized error messages for various tool operations.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on user identity, auto-refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login state, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useSeoMeta.ts": "Updates document title and description meta tag based on provided title and description.",
  "frontend/src/hooks/useToolJob.ts": "Manages job state for processing tools, including progress, results, errors, and a wrapper to run async jobs.",
  "frontend/src/index.css": "Configures Tailwind layers, theme variables, dark mode, prose styling, and utility classes for tool sections.",
  "frontend/src/lib/base64.ts": "Utilities for converting between File, base64, Uint8Array, and Blob formats.",
  "frontend/src/lib/download.ts": "Triggers browser-safe file downloads using Blob URLs with mobile-friendly cleanup timing.",
  "frontend/src/lib/fileFormat.ts": "Formats file sizes and provides human-friendly file type labels based on MIME type or extension.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/blog/BlogIndexPage.tsx": "Displays a list of blog posts with metadata and links, including SEO setup.",
  "frontend/src/pages/blog/HowToCompressPdfOnlinePage.tsx": "Renders a detailed guide article on compressing PDFs online with SEO metadata.",
  "frontend/src/pages/blog/ResizeImageUnder50KbPage.tsx": "Blog page explaining why 50KB image limits exist and how to resize an image using the site's resize tool, with links and tips.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with SEO metadata, hero section, tools grid, FAQ, and blog preview.",
  "frontend/src/pages/tools/AddWatermarkPage.tsx": "Tool page allowing users to upload a PDF, configure watermark text and style, preview it, and generate a watermarked PDF using client-side processing.",
  "frontend/src/pages/tools/CompressPdfPage.tsx": "Tool page for uploading and compressing a PDF in-browser, showing progress, FAQs, and related tool links.",
  "frontend/src/pages/tools/ImageToPdfPage.tsx": "Tool page for converting one or more images into a PDF with configurable page size and layout, processed fully in-browser.",
  "frontend/src/pages/tools/MergePdfPage.tsx": "Tool page that merges multiple PDFs into a single file using client-side processing, with FAQs and related links.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "Tool page to convert a PDF to a DOCX file with basic text extraction, including validation, processing state, and FAQs.",
  "frontend/src/pages/tools/RemovePagesPage.tsx": "React page for removing pages from a PDF, handling file selection, page range parsing, processing, and job state.",
  "frontend/src/pages/tools/ResizeImagePage.tsx": "Image resizing tool page with file validation, preview handling, and client-side resize processing.",
  "frontend/src/pages/tools/ResizePdfPage.tsx": "PDF page resizing interface allowing users to select a target size and run a browser-based resize process.",
  "frontend/src/pages/tools/SplitPdfPage.tsx": "PDF splitting tool that extracts each page into separate PDFs and returns a ZIP archive.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "Word-to-PDF conversion page that validates .docx files, sends them to a backend actor, and outputs a PDF.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines the project’s current state and requirements for rebuilding a Word‑to‑PDF tool using a Node.js backend with LibreOffice and a minimal frontend. Lists architectural notes, known issues, existing features, and new feature requests guiding the rebuild."
}