{
  "backend/main.mo": "Main actor that includes blob storage mixin and defines a convertWordToPdf function (currently a no-op stub).",
  "feature_evidence.json": "Feature evidence report documenting four logo/branding features: generating main logo, favicon, updating Navbar component, and updating index.html favicon references.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities with detailed descriptions of their functionality and recent updates.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with meta tags, favicon references pointing to generated favicon files, and root div for React app mounting.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including home, tool pages, blog pages, compliance pages, and 404 handler.",
  "frontend/src/components/ads/AdSlot.tsx": "Reusable ad placeholder component supporting seven variants (header-banner, sidebar, in-content, pre-download, in-article, post-tool, footer-banner) with appropriate dimensions.",
  "frontend/src/components/blog/blogPosts.ts": "Blog post registry exporting an array of BlogPost objects with metadata (slug, title, excerpt, route, date) for two articles.",
  "frontend/src/components/faq/ToolFaq.tsx": "Reusable FAQ component that renders an accordion of questions and answers passed via props, styled with card layout.",
  "frontend/src/components/home/BlogPreview.tsx": "Home page section displaying the two latest blog posts in a card grid with 'View All' button linking to blog index.",
  "frontend/src/components/home/Hero.tsx": "Hero section with headline, description, trust message with security badges (Secure, Private Processing, No Registration), and CTA button to start processing files.",
  "frontend/src/components/home/HomeFaq.tsx": "Home page FAQ section with accordion displaying five common questions about the service (free usage, accounts, security, file limits, mobile support).",
  "frontend/src/components/home/IntroContent.tsx": "Renders the homepage introduction section with headings and paragraphs describing PDF tools, image conversion tools, and document conversion tools offered by The Bharat PDF.",
  "frontend/src/components/home/toolsCatalog.ts": "Exports TOOLS_CATALOG array containing metadata for all PDF, image, and conversion tools including IDs, labels, descriptions, routes, icons, and categories.",
  "frontend/src/components/home/ToolsGrid.tsx": "Displays a responsive grid of tool cards from TOOLS_CATALOG, each with an icon, title, description, and a button that navigates to the tool's route.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with tool links organized by category, legal links, a copy-URL button, ad slot, and copyright information.",
  "frontend/src/components/layout/Navbar.tsx": "Provides a fixed header navigation bar with logo, desktop/mobile menus, dropdown for legal links, and a 'Get Started' button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout component that wraps pages with Navbar, Footer, ad slots (header banner and sidebar), and renders child routes via Outlet.",
  "frontend/src/components/seo/RelatedToolsLinks.tsx": "Displays a card with links to related tools based on provided tool IDs, filtering out the current tool from the list.",
  "frontend/src/components/seo/Seo.tsx": "SEO component that accepts meta tag props and applies them using the useSeoMeta hook for page title, description, and social media tags.",
  "frontend/src/components/tools/HowToUseSection.tsx": "Renders a numbered step-by-step instruction list for using a tool, displaying each step with a circular numbered badge.",
  "frontend/src/components/tools/image/ImageResizeOptions.tsx": "Configuration UI for image resizing with three modes (pixels, percentage, target-size), aspect ratio maintenance toggle, quality selector, and input validation. Auto-calculates height when width changes with aspect ratio locked.",
  "frontend/src/components/tools/pdf/ImageToPdfOptions.tsx": "Configuration card for converting images to PDF with options for page size (A4/Letter), fit mode (fit/fill/original), and adjustable margin slider.",
  "frontend/src/components/tools/pdf/RemovePagesOptions.tsx": "Configuration card for specifying which PDF pages to remove using comma-separated numbers and hyphenated ranges, with total page count display and usage examples.",
  "frontend/src/components/tools/pdf/ResizePdfOptions.tsx": "React component that renders a card with a dropdown selector for choosing PDF target page sizes (A4, Letter, Legal, A3, A5).",
  "frontend/src/components/tools/pdf/WatermarkOptions.tsx": "React component providing a form to configure PDF watermark settings including text, opacity, font size, rotation, position, and font style with sliders and select inputs.",
  "frontend/src/components/tools/pdf/WatermarkPreview.tsx": "React component that renders a canvas-based preview of how a watermark will appear on a PDF page with configurable position, rotation, and styling.",
  "frontend/src/components/tools/processors/conversion/excelToPdfProcessor.ts": "Client-side processor that converts Excel files to PDF by loading xlsx library from CDN, parsing workbook sheets, and rendering table data to PDF pages using pdf-lib.",
  "frontend/src/components/tools/processors/conversion/index.ts": "Barrel export file that re-exports all conversion processor functions for PDF, Word, Excel, PowerPoint, and image format conversions.",
  "frontend/src/components/tools/processors/conversion/jpegToJpgProcessor.ts": "Converts JPEG files to JPG format (essentially renaming extension) by loading image to canvas and re-encoding with quality control and progress tracking.",
  "frontend/src/components/tools/processors/conversion/jpgToJpegProcessor.ts": "Converts JPG files to JPEG format (essentially renaming extension) by loading image to canvas and re-encoding with quality control and progress tracking.",
  "frontend/src/components/tools/processors/conversion/pdfToExcelProcessor.ts": "Client-side processor that attempts basic PDF to Excel conversion by loading pdf-lib and xlsx libraries, with a note that it provides limited text extraction due to pdf-lib's lack of built-in text extraction capabilities.",
  "frontend/src/components/tools/processors/conversion/pdfToJpgProcessor.ts": "Converts PDF pages to JPG images using PDF.js for rendering and JSZip for packaging multiple pages. Renders each page to canvas at 2x scale, converts to JPEG with configurable quality, and returns a ZIP file containing all page images.",
  "frontend/src/components/tools/processors/conversion/pdfToPowerpointProcessor.ts": "Converts PDF to PowerPoint by rendering each PDF page as an image using PDF.js and inserting into PPTX slides via PptxGenJS. Dynamically loads required libraries from CDN and creates a presentation with each page as a full-slide image.",
  "frontend/src/components/tools/processors/conversion/pdfToWordProcessor.ts": "Converts PDF to Word document using pdf-lib and docx libraries, with a limitation that it creates placeholder text instead of actual text extraction. Returns a DOCX file with page markers since pdf-lib lacks built-in text extraction capabilities.",
  "frontend/src/components/tools/processors/conversion/powerpointToPdfProcessor.ts": "Converts PowerPoint to PDF with a simplified approach that creates a PDF containing informational text about conversion limitations. Does not perform full PPTX parsing; instead generates a notice page recommending desktop tools for complex presentations.",
  "frontend/src/components/tools/processors/conversion/wordToPdfLibraries.ts": "Empty file with no content.",
  "frontend/src/components/tools/processors/conversion/wordToPdfProcessor.ts": "Converts Word documents (.doc and .docx) to PDF using a backend API with comprehensive validation for file type, size (10MB limit), and content. Handles progress reporting and generates appropriate output filenames.",
  "frontend/src/components/tools/processors/imageResizeProcessor.ts": "Resizes images using three modes (pixels, percentage, target-size) with aspect ratio maintenance and quality control. Validates inputs, loads images to canvas, calculates dimensions, and returns resized image blobs with configurable quality settings.",
  "frontend/src/components/tools/processors/pdf/addWatermarkProcessor.ts": "Adds customizable text watermarks to PDF pages with options for position, opacity, font style, rotation, and size. Validates file size (10MB limit) and reports progress during processing.",
  "frontend/src/components/tools/processors/pdf/compressPdfProcessor.ts": "Compresses PDF files using pdf-lib's object streams optimization with a 20MB file size limit. Logs original and compressed file sizes for comparison.",
  "frontend/src/components/tools/processors/pdf/imageToPdfProcessor.ts": "Converts multiple JPG/PNG images into a single PDF with configurable page size (A4/Letter), fit modes (fit/fill/original), and margins. Processes images sequentially with progress tracking.",
  "frontend/src/components/tools/processors/pdf/index.ts": "Barrel export file that re-exports all PDF processor functions and their associated types from the pdf processors directory.",
  "frontend/src/components/tools/processors/pdf/mergePdfProcessor.ts": "Merges multiple PDF files into a single document by copying all pages from each input file sequentially. Requires at least two files and validates 20MB size limit per file.",
  "frontend/src/components/tools/processors/pdf/pageSizes.ts": "Defines standard page size dimensions in points (A4, Letter, Legal, A3, A5) and provides a helper function to retrieve dimensions by size name.",
  "frontend/src/components/tools/processors/pdf/pdfBackendClient.ts": "Deprecated legacy module for backend PDF processing that now throws errors directing users to client-side processing. Kept for compatibility reference only.",
  "frontend/src/components/tools/processors/pdf/pdfClient.ts": "Shared utility module that dynamically loads pdf-lib from CDN with caching, and provides helper functions for file validation, progress tracking, and reading PDF files as ArrayBuffers.",
  "frontend/src/components/tools/processors/pdf/removePagesProcessor.ts": "Removes specified pages from a PDF by parsing page ranges/numbers and creating a new document with remaining pages. Validates that at least one page remains and enforces 10MB file size limit.",
  "frontend/src/components/tools/processors/pdf/resizePdfProcessor.ts": "Resizes PDF pages to a target page size (A4, Letter, Legal, A3, A5) by creating a new PDF document, scaling and centering each original page proportionally to fit the target dimensions using pdf-lib.",
  "frontend/src/components/tools/processors/pdf/splitPdfProcessor.ts": "Splits a multi-page PDF into individual single-page PDFs and packages them into a ZIP file using pdf-lib and JSZip, with dynamic library loading and progress tracking.",
  "frontend/src/components/tools/SelectedFilesList.tsx": "Displays a list of selected files with file name, type, size, and optional remove button for each file.",
  "frontend/src/components/tools/toolError.ts": "Defines ToolError interface and provides functions to normalize errors and generate user-friendly error messages for various tool-specific failures (file validation, backend connection, PDF processing, Word conversion, etc.).",
  "frontend/src/components/tools/ToolExperience.tsx": "Main orchestrator component for tool workflows that manages file upload, processing states (idle/uploading/processing/done/error), progress display, result downloads, and step indicators. Includes auto-scrolling to options after file selection and displays trust notes, ads, and error details.",
  "frontend/src/components/tools/ToolNextStepCallout.tsx": "Displays an animated alert with a sparkle icon and bouncing arrow to guide users to the next step in the tool workflow.",
  "frontend/src/components/tools/ToolPageShell.tsx": "Simple layout wrapper component that provides consistent page structure with title, description, and centered content container for tool pages.",
  "frontend/src/components/tools/ToolPrimaryActionButton.tsx": "Styled primary action button with green theme, optional icon, loading spinner state, and configurable size for tool operations.",
  "frontend/src/components/tools/ToolResultDownload.tsx": "Success screen component that displays a completion message with checkmark icon and download button for the processed file, includes post-tool ad slot.",
  "frontend/src/components/tools/ToolSecondaryActionButton.tsx": "Styled secondary action button with optional icon, configurable size and variant (outline/ghost) for non-primary tool actions.",
  "frontend/src/components/tools/ToolStepIndicator.tsx": "Visual progress indicator showing three steps (Upload File, Adjust Settings, Download Result) with checkmarks for completed steps and connecting lines.",
  "frontend/src/components/tools/UploadDropzone.tsx": "File upload component with drag-and-drop support, file type and size validation, error handling, and selected files list display. Validates against configured file size limits and accepted extensions.",
  "frontend/src/components/trust/TrustNotes.tsx": "Displays a three-column grid of trust indicators (Secure & Private, No Login Required, Fast Processing) with icons and descriptions to build user confidence.",
  "frontend/src/config/toolLimits.ts": "Defines file size limits for different tool types (default 20MB, images 5MB, conversions 10MB) and provides helper functions to generate user-friendly limit violation messages.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor with optional Internet Identity authentication, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useScrollToTop.ts": "Custom React hook that scrolls the window to the top on component mount, using instant scroll on mobile devices and smooth scroll on desktop.",
  "frontend/src/hooks/useSeoMeta.ts": "React hook that dynamically sets page title, meta description, Open Graph tags, and Twitter Card tags for SEO optimization based on provided options.",
  "frontend/src/hooks/useToolJob.ts": "React hook that manages tool processing job state (idle, uploading, processing, done, error) with progress tracking, error handling, and a generic startJob function for executing async tool operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom green-themed color system using OKLCH color space for light and dark modes, plus custom prose styles for blog content and enhanced watermark slider styling.",
  "frontend/src/lib/base64.ts": "Utility functions for converting between File objects, base64 strings, Uint8Arrays, and Blobs for handling binary data in the browser.",
  "frontend/src/lib/download.ts": "Browser file download utility with mobile-friendly handling that creates temporary download links with delayed cleanup for compatibility.",
  "frontend/src/lib/fileFormat.ts": "Utility functions to format file sizes in human-readable format and generate user-friendly file type labels from MIME types or extensions.",
  "frontend/src/lib/wordToPdfApi.ts": "API wrapper for Word-to-PDF conversion using backend actor, with progress tracking and comprehensive error handling for various failure scenarios including service unavailability.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "About page component describing The Bharat PDF's purpose, mission, tools, and value propositions with SEO metadata and scroll-to-top behavior.",
  "frontend/src/pages/blog/BlogIndexPage.tsx": "Blog listing page that displays all blog posts from blogPosts array in cards with title, excerpt, date, and read more links.",
  "frontend/src/pages/blog/HowToCompressPdfOnlinePage.tsx": "Blog article page providing a complete guide on how to compress PDFs online, including steps, benefits, compression techniques, privacy information, and links to related tools.",
  "frontend/src/pages/blog/ResizeImageUnder50KbPage.tsx": "Blog article page explaining how to resize images to under 50KB for job applications, government forms, and other use cases. Includes step-by-step instructions, tips, and links to the resize image tool.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with client-side validation, email display, success messaging, and SEO metadata for user support and feedback.",
  "frontend/src/pages/DisclaimerPage.tsx": "Displays a disclaimer page with sections covering no warranty, accuracy limitations, user responsibility, conversion quality, and liability limitations for The Bharat PDF tools. Uses SEO component and scrolls to top on mount.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that renders Hero, IntroContent, ToolsGrid, HomeFaq, BlogPreview components with ad slots interspersed. Includes SEO metadata for the homepage.",
  "frontend/src/pages/NotFoundPage.tsx": "404 error page with navigation options to return home or go back, plus quick links to popular tools like Merge PDF, Compress PDF, Word to PDF, and Resize Image.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Privacy policy page explaining client-side file processing, cookie usage, data collection practices, and user privacy protections. Includes last updated date and SEO metadata.",
  "frontend/src/pages/TermsPage.tsx": "Terms and conditions page covering acceptance of terms, service description, acceptable use policy, and user responsibilities. Includes last updated date and SEO metadata.",
  "frontend/src/pages/tools/AddWatermarkPage.tsx": "Tool page for adding customizable text watermarks to PDF files with options for opacity, font size, rotation, position, and font style. Includes live preview, FAQ section, and related tools links.",
  "frontend/src/pages/tools/CompressPdfPage.tsx": "Tool page for compressing PDF files to reduce file size while maintaining quality using lossless optimization. All processing happens client-side in the browser.",
  "frontend/src/pages/tools/ExcelToPdfPage.tsx": "Tool page for converting Excel spreadsheets (.xlsx, .xls) to PDF format with support for multiple sheets. Includes file validation, progress tracking, and FAQ section.",
  "frontend/src/pages/tools/ImageToPdfPage.tsx": "Tool page for converting multiple images (JPG, PNG) into a single PDF document with configurable page size, fit mode, and margins. Supports up to 20 images with customizable layout options.",
  "frontend/src/pages/tools/JpegToJpgPage.tsx": "Tool page for converting JPEG files to JPG format (essentially a file extension change with re-encoding at high quality). Includes FAQ explaining the difference between JPEG and JPG formats.",
  "frontend/src/pages/tools/JpgToJpegPage.tsx": "Page component for converting JPG to JPEG format with FAQ section and related tools links. Uses jpgToJpegProcessor for client-side conversion with progress tracking.",
  "frontend/src/pages/tools/MergePdfPage.tsx": "Page component for merging multiple PDF files into one document. Supports up to 10 files and uses mergePdfProcessor for client-side processing.",
  "frontend/src/pages/tools/PdfToExcelPage.tsx": "Page component for converting PDF tables to Excel spreadsheets (.xlsx). Uses pdfToExcelProcessor with manual process trigger and file selection state management.",
  "frontend/src/pages/tools/PdfToJpgPage.tsx": "Page component for converting PDF pages to JPG images. Handles single-page PDFs as JPG and multi-page PDFs as ZIP archives using pdfToJpgProcessor.",
  "frontend/src/pages/tools/PdfToPowerpointPage.tsx": "Page component for converting PDF pages to PowerPoint slides (.pptx). Each PDF page becomes a slide with the page rendered as an image using pdfToPowerpointProcessor.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "Page component for converting text-based PDFs to Word documents (.docx). Uses pdfToWordProcessor for basic text extraction with manual process trigger.",
  "frontend/src/pages/tools/PowerpointToPdfPage.tsx": "PowerPoint to PDF converter page component that handles .pptx/.ppt file uploads, processes conversions in-browser using powerpointToPdfProcessor, and displays FAQs about format support, quality, and security.",
  "frontend/src/pages/tools/RemovePagesPage.tsx": "PDF page removal tool page that allows users to specify page ranges to delete from a PDF, validates input, processes removal using removePagesProcessor, and displays FAQs about page range syntax.",
  "frontend/src/pages/tools/ResizeImagePage.tsx": "Image resizing tool page that validates image files (JPEG, PNG, WEBP up to 5MB), displays before/after previews with dimensions, and processes resizing using resizeImage processor with configurable options.",
  "frontend/src/pages/tools/ResizePdfPage.tsx": "PDF page resizing tool that scales PDF content to standard page sizes (A4, Letter, Legal, A3, A5) while maintaining aspect ratio, processing entirely in-browser using resizePdfProcessor.",
  "frontend/src/pages/tools/SplitPdfPage.tsx": "PDF splitting tool page that extracts each page into a separate PDF file, packages them into a ZIP archive, and processes everything client-side using splitPdfProcessor.",
  "frontend/src/pages/tools/word-to-pdf/INTEGRATION.md": "Integration documentation for the rebuilt Word-to-PDF module, listing all modified and new files including upload/progress/result/error cards, validation logic, API client, and FAQ content.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfErrorCard.tsx": "Error card component that displays conversion failure messages with conditional retry and start-over buttons based on error type (retryable vs non-retryable errors like invalid files).",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfFaq.ts": "FAQ data array containing six common questions and answers about Word-to-PDF conversion features, limits, and security.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfProgressCard.tsx": "Progress card component showing animated loader and progress bar during file upload and conversion stages with status messages and percentage display.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfResultCard.tsx": "Success card component displaying conversion completion with a download button for the PDF and option to process another file.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTheme.ts": "Theme configuration object defining green/white color scheme and styling constants for the Word-to-PDF tool UI.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTool.tsx": "Main orchestrator component managing the complete Word-to-PDF conversion workflow with state machine (idle, uploading, converting, success, error) and file handling logic.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfUploadCard.tsx": "Upload interface component with drag-and-drop support, file selection, and preview display showing selected file details before conversion.",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfValidation.ts": "File validation utility that checks Word documents for valid extensions (.doc/.docx), non-zero size, and 10MB size limit.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "Word to PDF converter page component that delegates to WordToPdfTool module, includes SEO metadata, FAQ section, related tools links, and ad placements while preserving existing layout structure.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project state file for 'The Bharat PDF' website tracking logo generation and integration features with green/white branding theme. Contains completed features for logo creation, favicon generation, and navbar/HTML updates to display the new branding assets."
}