{
  "backend/main.mo": "Defines watermark config types, stores them in a map keyed by user ID, and exposes functions to set and retrieve a user's watermark configuration.",
  "feature_evidence.json": "Feature evidence report listing multiple frontend file targets, feature descriptions, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries mapping many frontend file paths to short descriptions for build planning.",
  "frontend/index.css": "Tailwind CSS setup defining base variables, dark mode overrides, and global styles.",
  "frontend/index.html": "Basic HTML shell loading the React app through main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and initializes pdfMake on startup via useEffect.",
  "frontend/src/components/ads/AdSlot.tsx": "Renders placeholder ad slots with size variants and simple styling.",
  "frontend/src/components/blog/blogPosts.ts": "Exports metadata for available blog posts including slug, title, excerpt, route, and date.",
  "frontend/src/components/faq/ToolFaq.tsx": "Reusable accordion-based FAQ component for tool pages.",
  "frontend/src/components/home/BlogPreview.tsx": "Displays the two latest blog posts with preview cards and a link to the blog index.",
  "frontend/src/components/home/Hero.tsx": "Hero section with headline, description, and CTA button navigating to merge-pdf tool.",
  "frontend/src/components/home/HomeFaq.tsx": "Homepage FAQ section using accordion items with predefined common questions.",
  "frontend/src/components/home/toolsCatalog.ts": "Defines the Tool interface and exports a catalog of PDF, image, and conversion tools with metadata.",
  "frontend/src/components/home/ToolsGrid.tsx": "Renders a grid of tool cards from toolsCatalog and navigates users to each tool’s route.",
  "frontend/src/components/layout/Footer.tsx": "Displays site footer with tool links, resources, trust notes, and URL copy functionality.",
  "frontend/src/components/layout/Navbar.tsx": "Provides a responsive navigation bar with links, logo, and a mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with navbar, footer, and ad slots, including a sidebar for large screens.",
  "frontend/src/components/seo/RelatedToolsLinks.tsx": "Shows related tool links based on provided tool IDs using the tools catalog.",
  "frontend/src/components/seo/Seo.tsx": "Applies SEO metadata using a custom hook and renders nothing visually.",
  "frontend/src/components/tools/image/ImageResizeOptions.tsx": "Displays UI controls for resizing images by pixels, percentage, or target size and passes parsed options to a processor.",
  "frontend/src/components/tools/pdf/ImageToPdfOptions.tsx": "Offers controls for configuring image‑to‑PDF settings including page size, fit mode, and margins.",
  "frontend/src/components/tools/pdf/RemovePagesOptions.tsx": "UI for entering page numbers or ranges to remove from a PDF, with guidance and validation hints.",
  "frontend/src/components/tools/pdf/ResizePdfOptions.tsx": "Allows selecting a target page size for resizing PDF pages.",
  "frontend/src/components/tools/pdf/WatermarkOptions.tsx": "Provides controls to configure text watermark settings such as text, opacity, font, rotation, and position.",
  "frontend/src/components/tools/pdf/WatermarkPreview.tsx": "Renders a canvas preview of the configured watermark based on text, font, opacity, rotation, and placement.",
  "frontend/src/components/tools/processors/conversion/index.ts": "Exports conversion processors and related initialization utilities for Word‑PDF conversions.",
  "frontend/src/components/tools/processors/conversion/pdfToWordProcessor.ts": "Converts a PDF to a basic text-only DOCX by loading pdf-lib and docx libraries, creating placeholder text per page, and generating a Word document with progress updates and file-size validation.",
  "frontend/src/components/tools/processors/conversion/wordToPdfLibraries.ts": "Loads and initializes pdfMake and its VFS fonts from CDN, validating proper setup and exposing initialized instances for Word-to-PDF conversion.",
  "frontend/src/components/tools/processors/conversion/wordToPdfProcessor.ts": "Extracts text from a DOCX using JSZip and generates a simple text-only PDF with pdfMake, including progress reporting and library initialization checks.",
  "frontend/src/components/tools/processors/imageResizeProcessor.ts": "Resizes images by pixels, percentage, or target file size using canvas operations, with validation, progressive updates, and optional quality tuning.",
  "frontend/src/components/tools/processors/pdf/addWatermarkProcessor.ts": "Adds a text watermark to each PDF page using pdf-lib with configurable placement, font, opacity, rotation, and progress tracking.",
  "frontend/src/components/tools/processors/pdf/compressPdfProcessor.ts": "Loads and resaves a PDF with basic compression settings using pdf-lib, reporting progress and returning a potentially smaller PDF blob.",
  "frontend/src/components/tools/processors/pdf/imageToPdfProcessor.ts": "Converts image files (JPG/PNG) into a PDF, scaling and positioning each image based on fit mode, page size, and margins while tracking progress.",
  "frontend/src/components/tools/processors/pdf/index.ts": "Re-exports all PDF processor modules and related option types for unified access.",
  "frontend/src/components/tools/processors/pdf/mergePdfProcessor.ts": "Merges multiple PDF files into a single document by copying pages sequentially with progress reporting.",
  "frontend/src/components/tools/processors/pdf/pageSizes.ts": "Defines standard PDF page sizes and a helper to retrieve dimensions by name.",
  "frontend/src/components/tools/processors/pdf/pdfBackendClient.ts": "Deprecated backend PDF client with stubbed methods that always throw errors, kept only for compatibility.",
  "frontend/src/components/tools/processors/pdf/pdfClient.ts": "Provides shared utilities for loading pdf-lib, reading files, validating size, updating progress, and basic PDF operations.",
  "frontend/src/components/tools/processors/pdf/removePagesProcessor.ts": "Removes selected pages from a PDF, validating ranges and reconstructing a new document with progress tracking.",
  "frontend/src/components/tools/processors/pdf/resizePdfProcessor.ts": "Resizes each page of a PDF to a target page size by scaling and centering original content into a new document.",
  "frontend/src/components/tools/processors/pdf/splitPdfProcessor.ts": "Splits a PDF into individual pages and packages them into a ZIP file, loading JSZip dynamically and updating progress.",
  "frontend/src/components/tools/SelectedFilesList.tsx": "Lists selected files with type and size info and optional remove buttons.",
  "frontend/src/components/tools/toolError.ts": "Defines a ToolError type, normalizes errors, and maps them to user‑friendly messages based on content and tool ID.",
  "frontend/src/components/tools/ToolExperience.tsx": "Manages the full tool workflow including file upload, options, processing state, errors, and results.",
  "frontend/src/components/tools/ToolNextStepCallout.tsx": "Displays a visual callout prompting the user to proceed to the next step.",
  "frontend/src/components/tools/ToolPageShell.tsx": "Provides a page wrapper with a title, description, and content area for a tool page.",
  "frontend/src/components/tools/ToolPrimaryActionButton.tsx": "A styled primary action button supporting loading state and optional icons.",
  "frontend/src/components/tools/ToolResultDownload.tsx": "Shows a success message and provides a button to download the processed file.",
  "frontend/src/components/tools/ToolSecondaryActionButton.tsx": "A generic secondary action button supporting variants and optional icons.",
  "frontend/src/components/tools/ToolStepIndicator.tsx": "Renders a 3‑step progress indicator that highlights completed and current steps with dynamic styling.",
  "frontend/src/components/tools/UploadDropzone.tsx": "Provides a drag‑and‑drop file upload area with type and size validation, error handling, and optional file list display.",
  "frontend/src/components/trust/TrustNotes.tsx": "Renders a three‑item trust section highlighting security, no login, and fast processing.",
  "frontend/src/config/toolLimits.ts": "Defines file size limits and provides helper functions for generating error messages about limits and file types.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context for managing authentication via Internet Identity, including login, logout, and identity loading.",
  "frontend/src/hooks/useSeoMeta.ts": "Updates document title and description meta tag when called.",
  "frontend/src/hooks/useToolJob.ts": "Manages job state for tool processing, handling progress, results, and error normalization.",
  "frontend/src/index.css": "Defines Tailwind base styles, a green color theme, dark mode styles, prose formatting, and utility classes.",
  "frontend/src/lib/download.ts": "Implements a mobile‑friendly blob download helper using a temporary link element.",
  "frontend/src/lib/fileFormat.ts": "Formats file sizes and provides user‑friendly labels for common file types.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/blog/BlogIndexPage.tsx": "Renders the blog index with SEO metadata and a list of blog post cards linking to articles.",
  "frontend/src/pages/blog/HowToCompressPdfOnlinePage.tsx": "A blog article component explaining how to compress PDFs online, including steps, benefits, tips, and related tool links.",
  "frontend/src/pages/blog/ResizeImageUnder50KbPage.tsx": "A blog page guiding users on resizing images under 50KB with instructions, tips, use cases, and a call-to-action link to the resize tool.",
  "frontend/src/pages/HomePage.tsx": "Assembles the homepage with SEO metadata, hero section, tools grid, FAQ, and blog preview.",
  "frontend/src/pages/tools/AddWatermarkPage.tsx": "A tool page for adding text watermarks to PDFs, handling file selection, validation, processing, previews, and FAQs.",
  "frontend/src/pages/tools/CompressPdfPage.tsx": "A PDF compression tool page that processes a single PDF using the compress processor, displays progress, and shows FAQs and related tools.",
  "frontend/src/pages/tools/ImageToPdfPage.tsx": "A tool page that converts one or more images into a PDF with customizable layout options, processing logic, and FAQs.",
  "frontend/src/pages/tools/MergePdfPage.tsx": "A tool page for merging multiple PDFs in-browser, managing processing via useToolJob and providing FAQs and related tool links.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "Renders the PDF-to-Word conversion page, handling file selection, validation, processing, and user feedback.",
  "frontend/src/pages/tools/RemovePagesPage.tsx": "Provides UI and logic for removing specific pages from a PDF, including page range parsing and PDF processing.",
  "frontend/src/pages/tools/ResizeImagePage.tsx": "Implements an image resizing tool with file validation, preview handling, and in-browser resize processing.",
  "frontend/src/pages/tools/ResizePdfPage.tsx": "Allows users to resize PDF pages to standard dimensions and processes the PDF in-browser.",
  "frontend/src/pages/tools/SplitPdfPage.tsx": "Handles splitting a PDF into individual pages and packaging them into a ZIP file.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "Implements Word-to-PDF conversion with file selection, validation, and job-based progress handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current issues with pdfMake VFS loading and listing required fixes and existing feature requirements."
}