{
  "backend/main.mo": "Actor imports blob storage mixin and defines a stub convertWordToPdf method.",
  "feature_evidence.json": "Feature evidence report listing UI-related image resize fixes and associated source files.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing layout, tools, SEO, and utilities.",
  "frontend/index.css": "Tailwind CSS config defining color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML template loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining routes for all tools and blog pages.",
  "frontend/src/components/ads/AdSlot.tsx": "Simple ad placeholder component with size variants.",
  "frontend/src/components/blog/blogPosts.ts": "Static list of blog post metadata including slugs, titles, and dates.",
  "frontend/src/components/faq/ToolFaq.tsx": "Reusable FAQ accordion component rendering question‑answer items.",
  "frontend/src/components/home/BlogPreview.tsx": "Home page section showing latest two blog posts with read‑more links.",
  "frontend/src/components/home/Hero.tsx": "Hero section with headline, description, and CTA button linking to merge‑pdf.",
  "frontend/src/components/home/HomeFaq.tsx": "Home page FAQ section using accordion with predefined questions.",
  "frontend/src/components/home/toolsCatalog.ts": "Defines the Tool interface and exports a catalog of PDF, image, and conversion tools with metadata and icons.",
  "frontend/src/components/home/ToolsGrid.tsx": "Grid displaying all tools from TOOLS_CATALOG with start buttons.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with tool links, trust notes, and a URL copy feature.",
  "frontend/src/components/layout/Navbar.tsx": "Implements the site navbar with navigation links, logo, mobile menu, and a 'Get Started' button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Provides the main page layout with navbar, ads, sidebar, content outlet, and footer.",
  "frontend/src/components/seo/RelatedToolsLinks.tsx": "Displays related tool links filtered from the tools catalog.",
  "frontend/src/components/seo/Seo.tsx": "Applies SEO meta tags using the useSeoMeta hook.",
  "frontend/src/components/tools/image/ImageResizeOptions.tsx": "UI for choosing image resize parameters including mode, dimensions, percentage, target size, aspect ratio, and quality.",
  "frontend/src/components/tools/pdf/ImageToPdfOptions.tsx": "Config panel for selecting PDF page size, image fit mode, and margin when converting images to PDF.",
  "frontend/src/components/tools/pdf/RemovePagesOptions.tsx": "Component for specifying page numbers or ranges to remove from a PDF.",
  "frontend/src/components/tools/pdf/ResizePdfOptions.tsx": "Selector for choosing a target PDF page size for resizing operations.",
  "frontend/src/components/tools/pdf/WatermarkOptions.tsx": "UI for configuring watermark text, style, position, opacity, size, and rotation.",
  "frontend/src/components/tools/pdf/WatermarkPreview.tsx": "Canvas-based live preview rendering the watermark according to current configuration.",
  "frontend/src/components/tools/processors/conversion/index.ts": "Barrel file exporting PDF/Word conversion processors and related types.",
  "frontend/src/components/tools/processors/conversion/pdfToWordProcessor.ts": "Converts a PDF to a basic text-only Word document using pdf-lib and a CDN-loaded docx library, with progress tracking and size validation.",
  "frontend/src/components/tools/processors/conversion/wordToPdfLibraries.ts": "Empty placeholder file for Word-to-PDF related libraries.",
  "frontend/src/components/tools/processors/conversion/wordToPdfProcessor.ts": "Validates a Word file and converts it to PDF via a backend API, returning the output filename and blob with progress updates.",
  "frontend/src/components/tools/processors/imageResizeProcessor.ts": "Resizes images based on pixels, percentage, or target size with validation, aspect ratio handling, and progress reporting.",
  "frontend/src/components/tools/processors/pdf/addWatermarkProcessor.ts": "Loads a PDF and adds text watermarks to each page using configurable font, position, opacity, and progress updates.",
  "frontend/src/components/tools/processors/pdf/compressPdfProcessor.ts": "Compresses PDFs client-side with pdf-lib by re-saving with optimized options and tracks progress.",
  "frontend/src/components/tools/processors/pdf/imageToPdfProcessor.ts": "Creates a PDF from one or more images, supporting page size, fit mode, margins, and progress tracking.",
  "frontend/src/components/tools/processors/pdf/index.ts": "Exports all PDF-related processors and types for merging, splitting, compressing, resizing, removing pages, watermarking, and image conversion.",
  "frontend/src/components/tools/processors/pdf/mergePdfProcessor.ts": "Merges multiple PDFs by copying pages into a new document using pdf-lib with progress tracking.",
  "frontend/src/components/tools/processors/pdf/pageSizes.ts": "Defines standard page sizes and provides a helper to retrieve their dimensions.",
  "frontend/src/components/tools/processors/pdf/pdfBackendClient.ts": "Deprecated backend PDF client that now only throws errors, kept for compatibility but unused.",
  "frontend/src/components/tools/processors/pdf/pdfClient.ts": "Provides client-side PDF utilities, dynamically loading pdf-lib from CDN and offering helpers for page counting, file-size validation, progress updates, and ArrayBuffer reading.",
  "frontend/src/components/tools/processors/pdf/removePagesProcessor.ts": "Implements page removal from a PDF using pdf-lib, including input validation, progress reporting, and rebuilding a new PDF without specified pages.",
  "frontend/src/components/tools/processors/pdf/resizePdfProcessor.ts": "Resizes PDF pages to a target size by scaling and centering content into new pages using pdf-lib with progress tracking.",
  "frontend/src/components/tools/processors/pdf/splitPdfProcessor.ts": "Splits a PDF into individual pages, packages them into a ZIP using JSZip, and reports progress throughout processing.",
  "frontend/src/components/tools/SelectedFilesList.tsx": "Shows a list of selected files with file info and optional remove actions.",
  "frontend/src/components/tools/toolError.ts": "Defines a structured ToolError and utilities to normalize errors and generate user-friendly error messages for various tool scenarios.",
  "frontend/src/components/tools/ToolExperience.tsx": "Manages the full tool workflow including upload, options, progress, errors, and result display.",
  "frontend/src/components/tools/ToolNextStepCallout.tsx": "Visual callout prompting the user to proceed to the next step.",
  "frontend/src/components/tools/ToolPageShell.tsx": "Wraps tool pages with a title, description, and structured layout.",
  "frontend/src/components/tools/ToolPrimaryActionButton.tsx": "Styled primary action button supporting icons and loading state.",
  "frontend/src/components/tools/ToolResultDownload.tsx": "Shows the success UI and provides a button to download the processed file.",
  "frontend/src/components/tools/ToolSecondaryActionButton.tsx": "Secondary action button with optional icon and variant styling.",
  "frontend/src/components/tools/ToolStepIndicator.tsx": "Displays a three‑step progress indicator for tool workflows.",
  "frontend/src/components/tools/UploadDropzone.tsx": "Drag-and-drop file selector with validation for types, sizes, and counts, passing chosen files upward.",
  "frontend/src/components/trust/TrustNotes.tsx": "Renders a UI section highlighting security, privacy, no-login use, and fast client-side processing.",
  "frontend/src/config/toolLimits.ts": "Contains file size limits and predefined user-friendly error messages for various tool constraints.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using Dfinity AuthClient, including login state and stored identity loading.",
  "frontend/src/hooks/useSeoMeta.ts": "Hook that updates the document title and meta description tags based on provided values.",
  "frontend/src/hooks/useToolJob.ts": "Manages a tool job’s state including upload, processing, progress updates, completion, and error handling.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, color variables, typography, and utility classes including prose and tool section styling.",
  "frontend/src/lib/base64.ts": "Utility functions for converting files to base64, base64 to Uint8Array, and base64 to Blob.",
  "frontend/src/lib/download.ts": "Provides a function to trigger mobile-friendly blob downloads via a temporary link.",
  "frontend/src/lib/fileFormat.ts": "Formats file sizes and derives human-readable file type labels from MIME types or extensions.",
  "frontend/src/lib/wordToPdfApi.ts": "Handles Word-to-PDF conversion by sending file bytes to the backend with progress updates and detailed error mapping.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/blog/BlogIndexPage.tsx": "Displays a list of blog posts with metadata, SEO info, and links to individual articles.",
  "frontend/src/pages/blog/HowToCompressPdfOnlinePage.tsx": "Renders a detailed guide article on compressing PDFs online with SEO metadata.",
  "frontend/src/pages/blog/ResizeImageUnder50KbPage.tsx": "Blog page explaining how to resize images under 50KB with steps, tips, and links to the resize tool.",
  "frontend/src/pages/HomePage.tsx": "Home page combining SEO setup with hero, tools grid, FAQ, and blog preview components.",
  "frontend/src/pages/tools/AddWatermarkPage.tsx": "Tool page allowing users to upload a PDF and apply customizable text watermarks using client-side processing.",
  "frontend/src/pages/tools/CompressPdfPage.tsx": "PDF compression tool that processes a single PDF in-browser and displays FAQs and related tools.",
  "frontend/src/pages/tools/ImageToPdfPage.tsx": "Converts multiple images to a single PDF with configurable page size and layout, using client-side processing.",
  "frontend/src/pages/tools/MergePdfPage.tsx": "Merges multiple PDFs into one file in-browser, with FAQs and related tool links.",
  "frontend/src/pages/tools/PdfToWordPage.tsx": "Converts a PDF to a DOCX file using browser-based text extraction with basic formatting support.",
  "frontend/src/pages/tools/RemovePagesPage.tsx": "UI page for removing pages from a PDF, handling file selection, page-range parsing, processing, and job state management.",
  "frontend/src/pages/tools/ResizeImagePage.tsx": "Image resizing tool page with file validation, previews, dimension extraction, processing, and job result handling.",
  "frontend/src/pages/tools/ResizePdfPage.tsx": "PDF resizing page allowing users to select a target page size, run the resize processor, and manage job state.",
  "frontend/src/pages/tools/SplitPdfPage.tsx": "Page for splitting a PDF into individual pages packaged as a ZIP, using the split processor and ToolExperience UI.",
  "frontend/src/pages/tools/word-to-pdf/INTEGRATION.md": "Documentation describing how the rebuilt Word‑to‑PDF module integrates into the app and listing modified and new components.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfErrorCard.tsx": "Error display component showing conversion errors and a retry button.",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfFaq.ts": "Exports the FAQ list shown on the Word-to-PDF tool page.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfProgressCard.tsx": "Progress UI card showing upload/convert status, file name, and progress bar.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfResultCard.tsx": "Displays the successful conversion result with a download button and option to process another file.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTheme.ts": "Defines green/white theme classes and colors for the Word-to-PDF tool UI.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfTool.tsx": "Main container managing Word-to-PDF upload, validation, conversion flow, progress, success, and error states.",
  "frontend/src/pages/tools/word-to-pdf/WordToPdfUploadCard.tsx": "Renders the upload/dropzone UI and selected-file preview with convert and remove actions.",
  "frontend/src/pages/tools/word-to-pdf/wordToPdfValidation.ts": "Validates Word file type and size, returning structured errors for invalid inputs.",
  "frontend/src/pages/tools/WordToPdfPage.tsx": "Main Word‑to‑PDF conversion page using WordToPdfTool, with SEO, layout, FAQ, and ads integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, containers, and plugins.",
  "project_state.json": "Tracks project state, features, known issues, and active UI/UX fix requests for the image resize tool."
}