{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rebuild Word→PDF as backend-conversion flow and remove pdfMake",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all pdfMake client-side Word→PDF code and any startup initialization so the app never loads or references pdfMake/CDN scripts.",
      "acceptanceCriteria": [
        "Navigating anywhere in the app (including /word-to-pdf) does not load or reference pdfMake.",
        "Remove the startup pdfMake initialization in frontend/src/App.tsx (no initPdfMake call on app mount).",
        "Remove/retire the pdfMake-based modules (e.g., wordToPdfProcessor, wordToPdfLibraries) or refactor them so they are no longer used/referenced by the Word-to-PDF page.",
        "No user-facing error messages referencing pdfMake appear during normal usage of the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the pdfMake startup initialization: delete the initPdfMake import and the useEffect that calls it, ensuring the app no longer attempts to initialize/load pdfMake."
        },
        {
          "path": "frontend/src/components/tools/processors/conversion/index.ts",
          "operation": "modify",
          "description": "Remove exports that expose pdfMake/CDN loader utilities (e.g., initPdfMake/loadConversionLibraries) so no other frontend code can import them."
        },
        {
          "path": "frontend/src/components/tools/processors/conversion/wordToPdfLibraries.ts",
          "operation": "delete",
          "description": "Delete the pdfMake/JSZip CDN loader module so there is no remaining pdfMake initialization/loading logic in the codebase."
        },
        {
          "path": "frontend/src/components/tools/processors/conversion/wordToPdfProcessor.ts",
          "operation": "delete",
          "description": "Delete the client-side pdfMake-based Word→PDF processor so the Word-to-PDF page can no longer use or reference it."
        },
        {
          "path": "frontend/src/pages/tools/WordToPdfPage.tsx",
          "operation": "modify",
          "description": "Remove any imports/usages of the deleted pdfMake-based processor and any pdfMake-related error wording; switch the page to the new backend-based conversion flow."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Rebuild the Word→PDF page UI into a clear 3-step flow (Upload → Convert → Download) with a green primary button, loading/success states, and simple English messaging using only locally-bundled code.",
      "acceptanceCriteria": [
        "The /word-to-pdf page clearly presents the 3 steps and a single primary green Convert button.",
        "After selecting a file, the page displays the selected file name.",
        "When conversion is in progress, the Convert button is disabled and shows a loading state (e.g., button text changes to \"Converting...\" and/or a spinner).",
        "On success, the page shows a clear success message in English and provides a Download PDF action that downloads the converted PDF.",
        "All user-facing strings on this tool page are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tools/WordToPdfPage.tsx",
          "operation": "modify",
          "description": "Rebuild the page UI to explicitly communicate the 3 steps (Upload Word file → Convert → Download PDF), keep one clear primary green Convert button (use existing ToolPrimaryActionButton), show selected file name via the existing ToolExperience/SelectedFilesList flow, and ensure Convert is disabled + shows loading while processing. Use only locally-bundled code (no CDN libraries)."
        },
        {
          "path": "frontend/src/components/tools/ToolExperience.tsx",
          "operation": "modify",
          "description": "Adjust any generic step/callout microcopy if needed to keep the Word→PDF flow non-confusing and consistent with a simple 3-step process (keep text in English)."
        },
        {
          "path": "frontend/src/components/tools/ToolResultDownload.tsx",
          "operation": "modify",
          "description": "Remove or neutralize the footer copy that claims files are processed in-browser so success UI remains accurate for backend-based conversions while preserving the existing download action UX."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Enforce strict frontend validation for Word→PDF: only .docx, max 10MB, and clear English errors; only enable Convert when one valid file is selected.",
      "acceptanceCriteria": [
        "The upload control rejects non-.docx files and surfaces an English validation error (no conversion attempt is started).",
        "Files larger than 10MB are rejected with an English validation error (no conversion attempt is started).",
        "The Convert button is not enabled unless exactly one valid .docx file (<=10MB) is selected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tools/WordToPdfPage.tsx",
          "operation": "modify",
          "description": "Set acceptedFileTypes to \".docx\" only; pass an explicit 10MB maxFileSizeBytes to the upload experience; ensure Convert button enablement requires exactly one selected file and add a defensive pre-submit validation that returns a clear English error without starting conversion when invalid."
        },
        {
          "path": "frontend/src/components/tools/UploadDropzone.tsx",
          "operation": "modify",
          "description": "Ensure validation messaging remains clear and English for extension/size rejection for the Word→PDF use-case; keep behavior of rejecting invalid files without calling onFilesSelected."
        },
        {
          "path": "frontend/src/config/toolLimits.ts",
          "operation": "modify",
          "description": "Confirm/align conversion file size limit to 10MB and ensure any limit-related messages remain clear and English for the Word→PDF tool flow."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Wire the Word→PDF Convert action to the existing backend conversion capability and download the returned PDF bytes with a derived filename; show clear errors on failure.",
      "acceptanceCriteria": [
        "Clicking Convert uploads the selected .docx to the backend conversion endpoint and waits for a response.",
        "On success, the frontend receives PDF bytes/blob and enables downloading a .pdf file with a filename derived from the original (.docx → .pdf).",
        "If the backend returns an error, the frontend shows a clear English error message and returns to an idle state (Convert becomes enabled again)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tools/WordToPdfPage.tsx",
          "operation": "modify",
          "description": "Use the existing useActor hook to call the backend conversion capability (convertWordToPdf) from the Convert action; show loading state via the existing job state; on success, decode the returned data into a PDF Blob and complete the job with a filename derived from the original (.docx → .pdf); on failure, surface a clear English error and reset to idle state."
        },
        {
          "path": "frontend/src/lib/base64.ts",
          "operation": "create",
          "description": "Add small local utilities to (1) convert a File/ArrayBuffer to a base64 string for sending to the backend and (2) convert a base64 string returned from the backend into a Uint8Array/Blob for download (no CDN libraries)."
        },
        {
          "path": "frontend/src/components/tools/toolError.ts",
          "operation": "modify",
          "description": "Update error normalization/messaging so any Word→PDF backend conversion failures map to clear, non-confusing English messages (and do not mention pdfMake/CDNs)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update Word→PDF page metadata and copy to match backend-based conversion; remove any claims about in-browser conversion and remove all pdfMake/CDN references in UI text.",
      "acceptanceCriteria": [
        "The Word-to-PDF page no longer claims conversion happens locally/in-browser.",
        "The page description/help text is minimal, clear, and consistent with a backend conversion flow.",
        "No references to pdfMake or CDN loading appear in the Word-to-PDF tool UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tools/WordToPdfPage.tsx",
          "operation": "modify",
          "description": "Update SEO title/description, page description, and FAQs/help text to remove any claims of in-browser/local conversion and to reflect a simple backend-based upload/convert/download flow; ensure there are no UI references to pdfMake or CDN loading."
        },
        {
          "path": "frontend/src/components/home/toolsCatalog.ts",
          "operation": "modify",
          "description": "Review and adjust the Word→PDF tool description text (if needed) so it does not imply in-browser conversion and remains minimal and non-confusing."
        }
      ]
    }
  ]
}